# Controlled Application Properties

Source: https://www.revitapidocs.com/2026/97358e8b-c07f-af92-424e-9c6d9f0c6043.htm

---

| Controlled Application Properties |
| --- |

The ControlledApplication type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ActiveAddInId |  |
|  | AllUsersAddinsLocation | Add\-ins location for all users. |
|  | Cities |  |
|  | Create |  |
|  | CurrentUserAddinsLocation | Add\-ins location for current user. |
|  | CurrentUsersAddinsDataFolderPath | Path to AddinsData folder for the current user. |
|  | CurrentUsersDataFolderPath | Path to data folder for the current user. |
|  | IsLateAddinLoading | Indicates whether this add\-in is loaded on the fly or not. If it is loaded when is Revit starting up, it is false, otherwise it should be true. |
|  | Language |  |
|  | Product |  |
|  | RecordingJournalFilename | Retrieve the name of the journal file that Revit is currently recording to. |
|  | SharedComponentsLocation | Location of shared components used by Revit. |
|  | SharedParametersFilename |  |
|  | SubVersionNumber | The minor version number of Revit. |
|  | VersionBuild |  |
|  | VersionName |  |
|  | VersionNumber |  |

Top See Also

#### Reference

ControlledApplication Class Autodesk.Revit.ApplicationServices Namespace